01_intro_to_rails/flatiron-theater/app/controllers/productions_controller.rb

SELECT "productions".* FROM "productions"
---
    def index
        render json: Production.all, status: :ok

SELECT "productions".* FROM "productions" WHERE "productions"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        render json: Production.find(params[:id]), status: :ok